<template>
    <q-page style="min-height:400px">  
      <section dir="rtl" class="q-pa-lg text-justify">
         <div class="blogDetails">
        <div v-for="item in magazines.filter(item=>item.id == $route.params.blogId)" :key="item.id">
            <h6 class="text-center text-primary text-weight-bolder">هر آنچه راجع به {{ item.title }} نیاز است بدانید</h6>
           <div class="column justify-center items-center">
            <q-img class="q-mb-xl" style="background-position: center;background-size: cover;" width="100%" height="400px" :src="item.src"></q-img>
           <h2 class="main-title  text-primary">{{ item.title }}    چیست؟</h2>
            <p class="text-fontSize">{{ item.caption }}</p> 
            <q-separator light class="q-my-lg" />
            <h2 class="main-title text-primary">   چرا باید {{ item.title }} بخریم؟</h2>
            <p class="text-fontSize">{{ item.subCaption }}</p> 
            <div>
            <LottieAnimation
            :animationData="item.lottieData"
            :loop="true"
            style="width:100%;"
            :autoplay="true"
            />
          </div>
          <h6 class="text-primary">سخن پایانی</h6>
          <p class="text-fontSize">
            با توجه به قوانین خاص بیمه، پیش از هرچیزی خوب است بدانید بهترین راه انتخاب {{ item.title }}  چیست؟ با توجه به   خطرات احتمالی که ممکن است جان یا مال شما را به خطر بیندازد و همچنین مشورت با کارشناس‌های بیمه، بهترین بیمه‌نامه را برای خود انتخاب کنید و در صورت ایجاد ضرر، به خاطر داشته باشید مدارکی که  ضرر را ثابت می‌کند را به همراه داشته باشید. با رعایت این دو اصل، می‌توانید از انتخاب خود مطمئن شوید .
          </p>
           </div>
          </div>
         </div>
      </section>
    </q-page>
  </template>
  
  <script>
  import { defineComponent } from "vue";
  import LottieAnimation from '../components/lottie-animation.vue';
  import lottieData1 from 'src/travel-animation.json';
  import lottieData2 from 'src/life-animation.json';
  import lottieData3 from 'src/fire-animation.json';
  import lottieData4 from 'src/life-animation.json';
  export default defineComponent({
    name: "BlogDetails",
    data(){
      return{
        magazines : [
                {id : 1 , title : 'بیمه مسافرتی' , src:'src/assets/national-insurance.jpg'  , caption : 'بیمه مسافرتی یکی از انواع بیمه است که طبق قرارداد آن مسافر در مقابل حوادث و رخدادهای احتمالی و در طول سفر خواه داخلی یا خارجی تحت پوشش بیمه قرار می گیرد. سفر رفتن یکی از لذت‌بخش‌ترین فعالیت‌هایی است که هر شخصی می‌تواند در برنامه خود قرار دهد. در سفر است که افراد بسیاری از دغدغه‌ها را فراموش می‌کنند و برای مدتی از سختی‌های زندگی روزمره دور می‌شوند. اما خسارت و حادثه‌های مختلف، حتی در مسافرت هم همراه ما هستند. یکی از خدماتی که شرکت‌های بیمه به افراد ارائه می‌دهند بیمه مسافرتی است که در آن شرکت بیمه به فرد تعهد می‌دهد که درصدی از هزینه‌ی خسارت‌های حین سفر را جبران خواهد کرد.',subCaption : 'بزرگترین راز موفق شدن در هر کاری برنامه‌ریزی است. سفر هم از این قاعده مستثنا نیست. برنامه ریزی برای سفر این امکان را می دهد که تا حدودی از اتفاقات پیش رو باخبر شوید. مثلاً میتوانید پیش‌بینی کنید که در میانه سفر هوا سرد خواهد شد؛ بنابراین لباس گرم را در لیست وسایل مورد نیاز قرار خواهید داد.اما بعضی از اتفاقات بزرگتر از سرد شدن هوا هستند و خود فرد به تنهایی نمی‌تواند آمادگی‌های لازم برای جبران آن‌ها را داشته باشد.به طور مثال تغییرات آب و هوایی که باعث تغییر زمان پرواز یا کنسل شدن آن میشود در حیطه اختیارات مسافر نیست. یا برای جبران خسارت دزدیده شدن وسایل مهم در مقصد، فرد توانایی زیادی ندارد. اینجاست که بیمه مسافرتی شنل بر دوش به کمک سفر دوستان می‌شتابد. پس اگر خواستید برای کسی توضیح دهید که دقیقا بیمه مسافرتی چیست، میتوانید بگویید یکی از اقداماتی است که به سفر راحت و برنامه‌ریزی برای آن کمک می‌کند.به طور مثال تغییرات آب و هوایی که باعث تغییر زمان پرواز یا کنسل شدن آن میشود در حیطه اختیارات مسافر نیست. یا برای جبران خسارت دزدیده شدن وسایل مهم در مقصد، فرد توانایی زیادی ندارد. اینجاست که بیمه مسافرتی شنل بر دوش به کمک سفر دوستان می‌شتابد. پس اگر خواستید برای کسی توضیح دهید که دقیقا بیمه مسافرتی چیست، میتوانید بگویید یکی از اقداماتی است که به سفر راحت و برنامه‌ریزی برای آن کمک می‌کند.' , lottieData : lottieData1} ,
                {id : 2 , title : 'بیمه عمر' , src:'src/assets/rain.png' , caption : ' بیمه عمر یک قرارداد مالی بین بیمه‌گذار و شرکت بیمه است که در صورت وقوع حادثه برای فرد بیمه‌شده، شرکت بیمه موظف به پرداخت مبلغی مشخص به ذی‌نفعان او خواهد بود. این بیمه به‌منظور حمایت مالی و ایجاد آرامش خاطر برای افراد طراحی شده است. براین اساس اگر بخواهیم به تعریف بیمه عمر چیست بپردازیم باید  بگوییم؛ بیمه عمر یک راهکار مالی است که به شما کمک می‌کند تا آینده مالی خانواده و خود را تامین کنید و از نگرانی‌های مالی در مواقع بحرانی بکاهید.',subCaption : 'سود مشارکت در بیمه عمر، سودی است که بیمه‌گذار به دلیل مشارکت در سرمایه‌گذاری‌های شرکت بیمه دریافت می‌کند. شرکت بیمه بخشی از سود حاصل از سرمایه‌گذاری‌های خود را به عنوان سود مشارکت به بیمه‌گذاران پرداخت می‌کند.این سود می‌تواند به صورت سالانه یا دوره‌ای محاسبه و به اندوخته بیمه‌نامه افزوده شود.همچنین، مالیات بر ارث به سرمایه فوت و اندوخته این بیمه تعلق نمی‌گیرد و این مبلغ به‌طور کامل به ذی‌نفعان پرداخت می‌شود.بیمه‌گذار می‌تواند بیمه‌نامه خود را به شخص دیگری منتقل کند و همچنین ذی‌نفعان بیمه‌نامه را تعیین و تغییر دهد. این مورد یکی از مزایا بیمه عمر است که در مواردی مانند خرید‌و‌فروش ملک یا ازدواج می‌تواند بسیار مفید باشد.' , lottieData : lottieData2} ,
                {id : 3 , title : 'بیمه بدنه' , src:'src/assets/body-insurance.jpg' , caption : 'بیمه نامه بدنه خودرو یک نوع بیمه اختیاری است که برای جبران خسارات وارده به بدنه و اجزای خودرو در صورت وقوع حوادث مختلف طراحی شده است. درواقع به مالک خودرو این امکان را می‌دهد که در صورت بروز هرگونه آسیب فیزیکی به خودرو، از پوشش‌های مالی و حمایتی برخوردار شود.یکی از ویژگی‌های مهم بیمه بدنه خودرو این است که برخلاف بیمه شخص ثالث که اجباری است و تنها خسارات جانی و مالی وارده به افراد ثالث را پوشش می‌دهد، بیمه بدنه خودرو به طور مستقیم به مالک خودرو و خسارات وارده به خودروی او مربوط می‌شود.',subCaption : 'در صورتی که خودروی شما در اثر یکی از حوادث ذکر شد‌ه، دچار خسارت شود و باتری یا لاستیک آن آسیب ببیند، بیمه بدنه خسارت وارد شد‌ه را تا سقف تعهدات بیمه‌ای جبران می‌کند.میزان پوشش خسارت باتری و لاستیک، معمولاً ۵۰% قیمت نو آن است.این بدان معناست که اگر قیمت نو یک باتری ۱۰ میلیون تومان باشد، بیمـه بدنه، خسارت وارد شد‌ه به آن را تا سقف ۵ میلیون تومان جبران می‌کند.یکی از بهترین و جدید‌ترین تخفیفات موجود برای خرید بیمه بدنه که می‌توانید با استفاده از آن، بیمه بدنه خود را با قیمتی استثنایی خریداری کنید، تخفیفات ویژه خرید بیمه بدنه کاریزما بیمه است.' ,  lottieData : lottieData1} ,
                {id : 4 , title : 'بیمه آتش سوزی' , src:'src/assets/fire-insurance.jpg' , caption : 'قرارداد بيمه آتش سوزي توافقي است بين بيمه گذار از يك سو وبيمه گر از سوي ديگر كه براساس آن بيمه گر متعهد مي گردد در قبال در يافت حق بيمه  خسارت وارد به مورد بيمه (اموال بيمه شده )رادر صورت وقوع خطرات بيمه شده كه منجر به وارد آمدن خسارت به مورد بيمه شود در حدود تعهدات خود (سرمايه مورد بيمه )و براي دوره زماني معين جبران نمايد.بیمه آتش سوزی ساختمان، بیمه‌های اختیاری است که متأسفانه لزوم خرید آن، زمانی که خیلی دیر شده است، احساس میشود...', subCaption : 'با اين‌ نوع‌ پوشش‌ بيمه‌اي‌، بيمه‌گر خسارات‌ ناشي‌ از آتش‌سوزي‌ به‌ اموال‌ مورد بيمه‌ را تا حداكثرسرمايه‌ مندرج‌ در بيمه‌نامه‌ و به‌ ميزان‌ زيان‌ وارد شده‌ جبران‌ مي‌كند. اصولا خسارات‌ پرداختني‌نمي‌توانداز مابه‌التفاوت‌ ارزش‌ هر يك‌ از اقلام‌بيمه‌شده‌ بلافاصله ‌قبل‌ و بعداز بروز خسارت‌ و يا در صورت‌ وقوع‌ حادثه‌ منجر به‌ خسارت‌ كلي‌، از مبلغ‌ بيمه‌ شده‌ هريك‌ از اقلام‌ خسارت‌ ديده‌ بيشتر باشد. از ويژگي هاي‌ خوب‌ اين‌ نوع‌ پوشش‌ بيمه‌اي‌ آن‌ است‌ كه‌ در بيمه‌نامه‌هاي‌ اظهارنامه‌اي‌، سقف‌ حداكثري‌ براي‌ تعهد بيمه‌گر در مورد جبران‌ خسارت‌ معين‌ مي‌شود بنابراین در بیمه آتش‌سوزی، خسارت‌های مالی مورد تأمین قرار می‌گیرند نه خسارت‌های جانی و بدنی. لذا، درصورتیکه صدمه‌ای به افراد برسد، معمولاً این بیمه آنرا پوشش نمی‌دهد. ' ,lottieData : lottieData3} ,
                {id : 5 , title : 'بیمه شخص ثالث' , src:'src/assets/car-insurance.jpg' , caption : 'بیمه شخص ثالث، طرح بیمه‌های الزامی برای دارندگان وسایل نقلیه موتوری است.در بیمه شخص ثالث، مالک وسیله نقلیه شخص اول به شمار می آید.( اکثر بیمه‌نامه‌ها تحت عنوان بیمه‌گزار شناخته می‌شود)، شخص ثانی شرکت بیمه است که متعهد به جبران هزینه‌ها طبق بیمه‌نامه است. شرکت بیمه در بیمه‌نامه با عنوان بیمه‌گر درج می‌شود. در نهایت، شخص ثالث فرد زیان‌دیده در حوادث رانندگی است. تمامی اشخاصی که در یک حادثه تصادف، زیان مالی و جانی می‌بینند تحت پوشش بیمه شخص ثالث قرار می‌گیرند. این بیمه هزینه‌های مربوط به درمان، فوت و خسارات به اموال را جبران می‌کند.' , subCaption : 'این بیمه هزینه‌های مربوط به درمان، فوت و خسارات وارد شده به اموال را جبران می‌کند. در اینگونه اتفاقات راننده مقصر هم می‌تواند از مزایای بیمه حوادث راننده که شاخه‌ای جدید از بیمه شخص ثالث به شمار می‌آید استفاده کند. باید توجه داشت که بیمه حوادث راننده فقط  زیان‌های جانی را به عهده می‌گیرد و در مقابل زیان‌های مالی هیچ گونه مسئولیتی ندارد.'  , lottieData : lottieData4} ,

            ] ,
            
      }
    } , 
    components:{
      LottieAnimation
    }
    
  });
  </script>
  
<style scoped>
.text-fontSize{
  font-size: 17px;
  line-height: 30px;
}
.main-title{
  font-size: 30px;
}


 .title span {
      font-size: 20px;
    }

    @media (max-width: 1023px) {
    .title {
      margin-top: 30px;
    }
  }
</style>
  